# The block of messages below are only found in this file. If you'd
# like to override them for other languages, simply add the keys
# to the other resource bundles.

# Correspondencia de caracteres especiales con el correspondiente en JAVA
# Latin1   JAVA            Latin1   JAVA
# Á        \u00c1          á        \u00e1
# É        \u00c9          é        \u00e9
# Í        \u00cd          í        \u00ed
# Ó        \u00d3          ó        \u00f3
# Ú        \u00da          ú        \u00fa
# Ñ        \u00d1          ñ        \u00f1
#
# Æ        \u00C6
#
# Space    \u2008


#-----Mensajes de error genericos-----

ERROR_GENERICO=Error no controlado
ERROR_GETOBJECT=Error intentando recuperar el objeto de BD
ERROR_SIN_MENSAJE=Error desconocido
ERROR_CONFIGURACION=Error debido a una configuraci\u00f3n incorrecta. Remita el siguiente error a su administrador:
ERROR_ACCESO_SESION=Se produjo un error al acceder a la sesi\u00f3n.
ERROR_FECHA_INCORRECTA=El formato de fecha es incorrecto (dd/mm/yyyy).
ERROR_HORA_INCORRECTA=El formato de hora es incorrecto (hh:mm:ss).
ERROR_NO_DESEADO=En estos momentos no se puede realizar la operaci\u00f3n. Int\u00e9ntelo m\u00e1s tarde.
ELEMENTOSELECCIONADO_ID_NO_VALIDO=El identificador del elemento seleccionado no es v\u00e1lido.
ERROR_SEARCH_MAXIMO=N\u00famero demasiado elevado de registros en la b\u00fasqueda
ERROR_SEARCH_CERO=No se ha encontrado ning\u00fan registro con los par\u00e1metros de b\u00fasqueda
ERROR_PROPERTIES_FILE_NOT_FOUND=No se ha encontrado el fichero de propiedades.
ERROR_PROPERTY_NOT_FOUND=No se ha encontrado la propiedad en el fichero de propiedades.
ERROR_SEARCH_METHOD_NOT_IMPLEMENTED=M\u00e9todo no implementado en este Search Server
ERROR_SEARCH_GENERICO=Error no controlado en el Search Server
ERROR_CLASS_NOT_FOUND=La clase no ha sido encontrada
ERROR_INSTANTIATION=El objeto no ha podido ser instanciado
ERROR_ACCESS=No se puede acceder a la clase, atributo, m\u00e9todo o constructor
ERROR_ARGUMENTO_ILEGAL=El valor del argumento no es v\u00e1lido
ERROR_SECURITY=Violaci\u00f3n de seguridad
ERROR_NO_SUCH_METHOD=El m\u00e9todo no existe
ERROR_INVOCATION=Error al invocar el m\u00e9todo
ERROR_CONVERT_LIST_ITEM=Se ha producido un error al convertir una cadena a list item para mostrar en la vista.
ERROR_BIBLIOTECA_ACTUAL_NULA=El usuario actual no tiene ninguna biblioteca asignada.
ERROR_BIBLIOTECA_LECTOR_NULA=No existe una biblioteca asignada para el lector en la operaci\u00f3n curso.
ERROR_BIBLIOTECA_EJEMPLAR_NULA=No existe una biblioteca asignada para el ejemplar en la operaci\u00f3n curso.
ERROR_NO_ENCONTRADA=No se ha encontrado la biblioteca solicitada


#-----Mensajes de error de BD-----

ERROR_CNX_BD=No ha sido posible conectar con la Base de Datos
ERROR_INSERT_BD=No ha sido posible guardar el objeto en la Base de Datos
ERROR_DELETE_BD=No ha sido posible eliminar el objeto de la Base de Datos
ERROR_EXISTS_BD=No ha sido posible comprobar si existe el objeto en la Base de Datos
ERROR_SELECT_BD=No ha sido posible obtener el objeto de la Base de Datos
ERROR_GET_ALL_BD=No ha sido posible obtener todos los objetos de la Base de Datos
ERROR_SELECTS_BD=No ha sido posible obtener los objetos de la Base de Datos
ERROR_GENERAL_BD=Se produjo un error de base de datos
ERROR_TRANSACCION_NO_DEFINIDA=Se ha llamado a un m\u00e9todo transaccional en un entorno no transaccional
ERROR_CREANDO_OBJETO_TEMPORAL=No se puede guardar una entidad temporal. Este POJO tiene la propiedad temporal activa.
ERROR_CLONE_NON_LAZY=No se ha podido clonar el objeto. La siguiente clase no hereda de SpringRemotableLazyEntity


#-----Mensajes de error de generacion de report-----

XML_SCHEMA_ERROR=El Schema XML no es v\u00e1lido
XML_SCHEMA_ERROR_TYPE=El schema XML no es de un tipo v\u00e1lido
DATASOURCE_ERROR=Tipo de DataSource no v\u00e1lido
JASPER_FILE_ERROR=No existe el fichero jasper indicado
TIPO_FILE_ERROR=El tipo de fichero indicado no es correcto
ERROR_PDF_MAL_GENERADO=Se ha producido un error durante la generaci\u00f3n del fichero PDF
UNSUPPORTED_CHARSET_ENCODING=La codificaci\u00f3n escogida no es v\u00e1lida
EMPTY_DATA_ERROR=No existen datos para generar el archivo
FILE_NOT_FOUND=No existe el fichero indicado


#-----Mensajes de error de las inserciones-----
ERROR_INSERTAR_VALOR_CODIGO=Se ha producido un error al insertar el valor del código.

#-----Mensajes de error de las busquedas -----
ERROR_BUSCAR=Se ha producido un error en la b\u00fasqueda
ERROR_NINGUN_RESULTADO=No se ha encontrado ning\u00fan resultado en la b\u00fasqueda.
ERROR_UNICA_SELECCION_LISTADO=Solo se puede seleccionar un valor del listado.
ERROR_LIMPIAR=Se ha producido un error al limpiar el listado y el formulario.
ERROR_SELECCION_VACIA=Debe de seleccionar alg\u00fan elemento del listado.
ERROR_CREAR_PDF=Se ha producido un error al crear el pdf.
ERROR_CREAR_EXCEL=Se ha producido un error al crear el excel.

#-----Error en los arboles de bibliotecas -----
ERROR_BIBILIOTECA_VACIA=Debe de seleccionar una biblioteca.

#-----Error en los detalles y popPups -----
ERROR_BIBLIOTECA_DETALLE=Se ha producido un error y no se puede mostrar el detalle de la biblioteca.

#----- PROPERTIES USADAS EN COMMON-CORE (Constants.BUNDLE_KEY) -----
date.format=MM/dd/yyyy

# -- Mensajes de error en las validaciones (ValidationsUtil) --
VALID_ERROR_FORMAT = Ha introducido en la identificaci\u00f3n un formato incorrecto.
VALID_ERROR_CONTROL = Ha introducido un car\u00e1cter de control incorrecto en la identificaci\u00f3n.
VALID_ERROR_NIE = El n\u00famero en la identificaci\u00f3n no comienza con el car\u00e1cter X.
VALID_ERROR_CIF_EMPR = El car\u00e1cter de empresa insertado es incorrecto en la identificaci\u00f3n.
VALID_ERROR_CIF_PROV = El c\u00f3digo de provincia insertado es incorrecto en la identificaci\u00f3n.
VALID_ERROR_CONTROL_NUM = El car\u00e1cter de control debe ser un n\u00famero en la identificaci\u00f3n.
VALID_ERROR_CONTROL_LETR = El car\u00e1cter de control debe ser una letra en la identificaci\u00f3n.
VALID_ERROR_CONTROL_AMB = El car\u00e1cter de control debe ser una letra o un n\u00famero en la identificaci\u00f3n.


# -- Mensajes de error en el proceso de autenticación con @Firma --
ERROR_AUTENTICACION_AFIRMA_GENERICO=Ha ocurrido un problema con la autenticaci\u00f3n, contacte con su administrador.
ERROR_AUTENTICACION_AFIRMA_TICKET_INVALIDO=No se ha podido autenticar, no es la misma aplicaci\u00f3n para la cual se solicit\u00f3 el ticket, cierre el explorador y vuelva a intentarlo
ERROR_AUTENTICACION_AFIRMA_APPID_DISTINTO=No se ha podido autenticar, no es la misma aplicaci\u00f3n para la cual se solicit\u00f3 el ticket, cierre el explorador y vuelva a intentarlo
ERROR_AUTENTICACION_AFIRMA_TICKET_DISTINTO=No se ha podido autenticar, el ticket no coincide con el retornado por la fachada de autenticaci\u00f3n, cierre el explorador y vuelva a intentarlo
ERROR_AUTENTICACION_AFIRMA_SESSION_DISTINTA=No se ha podido autenticar, la sesi\u00f3n actual no corresponde con la retornada desde la fachada de autenticaci\u00f3n, cierre el explorador y vuelva a intentarlo
ERROR_AUTENTICACION_AFIRMA_COOKIES_DISABLED=No se ha podido autenticar, su explorador tiene desactivadas las cookies. Por favor, habilite esta caracter\u00edstica, cierre el explorador y vuelva a intentarlo
ERROR_AUTENTICACION_AFIRMA_SERVICEURL_NOT_FOUND=No se ha podido autenticar, falta el par\u00e1metro serviceUrl, revise como est\u00e1 invocando al componente de @Firma.
ERROR_AUTENTICACION_AFIRMA_USUARIO_INVALIDO=No se ha podido autenticar el certificado seleccionado. Revise su certificado. Es posible que est\u00e9 caducado.

WARNING_USUARIO_NIF_OBTENIDO_AFIRMA=Usuario validado en @Firma con NIF:
WARNING_USUARIO_NIF_NO_REGISTRADO_1=El usuario con NIF
WARNING_USUARIO_NIF_NO_REGISTRADO_2=no se encuentra registrado en la aplicaci\u00f3n

ERROR_USUARIO_BIBLIOTECA_ROL_NO_EXISTE=El usuario no estaba asigando a la raiz de la red de bibliotecas, o no ten\u00eda asignado el rol inicial vacio de Orbe

# -- Mensajes de error en listados --
ERROR_NUMERO_MAXIMO=Los pdf y excel tienen un máximo de {0} elementos en los listados.
